<a href="https://colab.research.google.com/github/Taiba053/Python_Projects/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
#import library
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [10]:
#import data
df = pd.read_csv('https://github.com/YBIFoundation/Dataset/raw/main/TheTitanic.csv')

In [11]:
print(df.info())
print(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1302 entries, 0 to 1301
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       1302 non-null   object
 1   2       1302 non-null   object
 2   3       1302 non-null   object
 3   4       1301 non-null   object
 4   5       1301 non-null   object
 5   6       1045 non-null   object
 6   7       1300 non-null   object
 7   8       1300 non-null   object
 8   9       1296 non-null   object
 9   10      1302 non-null   object
dtypes: object(10)
memory usage: 101.8+ KB
None
    1       2         3                            4       5    6       7  \
0  sn  pclass  survived                          NaN  gender  age  family
1   1       3         0                  Mr. Anthony    male   42       0
2   1       3         0                  Mr. Anthony    male   42       0
3   2       3         0        Master. Eugene Joseph    male    ?       2
4   3       2         0  Abbott, Mr. Rossmore Edward     NaN  NaN       2

       8         9         10
0   fare  embarked       date
1   7.55       NaN  01-Jan-90
2   7.55       NaN  01-Jan-90
3  20.25         S  02-Jan-90
4     **         S  03-Jan-90

In [12]:
#Fixing colum Names
df.columns = ['sn', 'pclass', 'survived', 'name', 'gender', 'age', 'family', 'fare', 'embarked', 'date']
print(df.head())

   sn  pclass  survived                         name  gender  age  family  \
0  sn  pclass  survived                          NaN  gender  age  family
1   1       3         0                  Mr. Anthony    male   42       0
2   1       3         0                  Mr. Anthony    male   42       0
3   2       3         0        Master. Eugene Joseph    male    ?       2
4   3       2         0  Abbott, Mr. Rossmore Edward     NaN  NaN       2

    fare  embarked       date
0   fare  embarked       date
1   7.55       NaN  01-Jan-90
2   7.55       NaN  01-Jan-90
3  20.25         S  02-Jan-90
4     **         S  03-Jan-90

In [6]:
#Handling Missing Values
df.isnull().sum()

sn            0
pclass        0
survived      0
name          1
gender        1
age         257
family        2
fare          2
embarked      6
date          0
dtype: int64

In [20]:
df = df[pd.to_numeric(df['sn'], errors='coerce').notnull()]
df['sn'] = df['sn'].astype(int)

df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['age'].fillna(df['age'].median(), inplace=True)

df['family'].fillna(0, inplace=True)
df['family'] = df['family'].astype(int)


df['embarked'].fillna(df['embarked'].mode()[0], inplace=True)
df['gender'].fillna(df['gender'].mode()[0], inplace=True)

df.dropna(subset=['fare'], inplace=True)

In [23]:
#converting data types
df['pclass'] = df['pclass'].astype(int)
df['survived'] = df['survived'].astype(int)
df['family'] = df['family'].astype(int)
df['date'] = pd.to_datetime(df['date'], format='%d-%b-%y')

In [25]:
df['family_size'] = df['family'] + 1

def extract_title(name):
    if ',' in name and '.' in name:
        return name.split(',')[1].split('.')[0].strip()
    else:
        return 'Unknown'

df['title'] = df['name'].apply(extract_title)

In [26]:
df = pd.get_dummies(df, columns=['gender', 'embarked', 'title'], drop_first=True)

In [27]:
#spliting Data
X = df.drop(['survived', 'name', 'date'], axis=1)
y = df['survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [28]:
#prediction
print(X_train.head())
print(X_test.head())
print(y_train.head())
print(y_test.head())

      sn  pclass   age  family     fare  family_size  gender_male  embarked_Q  \
148  147       2  42.0       0       13            1         True       False
871  870       1  64.0       0       26            1         True       False
523  522       1  28.0       0       30            1         True       False
810  809       1  33.0       1       90            2        False        True
343  342       1  54.0       2  81.8583            3        False       False

     embarked_S  title_Col  ...  title_Miss  title_Mlle  title_Mme  title_Mr  \
148        True      False  ...       False       False      False      True
871        True      False  ...       False       False      False      True
523        True      False  ...       False       False      False      True
810       False      False  ...        True       False      False     False
343        True      False  ...       False       False      False     False

     title_Mrs  title_Ms  title_Rev  title_Sir  title_Unknown  \
148      False     False      False      False          False
871      False     False      False      False          False
523      False     False      False      False          False
810      False     False      False      False          False
343       True     False      False      False          False

     title_the Countess
148               False
871               False
523               False
810               False
343               False

[5 rows x 27 columns]
        sn  pclass   age  family    fare  family_size  gender_male  \
1234  1233       2  40.0       0      13            1         True
579    578       3  30.0       0  7.2292            1         True
1167  1166       3  44.0       0   7.925            1         True
723    722       3  28.0       0  7.8792            1         True
562    561       3  28.0       0  22.525            1         True

      embarked_Q  embarked_S  title_Col  ...  title_Miss  title_Mlle  \
1234       False        True      False  ...       False       False
579        False       False      False  ...       False       False
1167       False        True      False  ...       False       False
723         True       False      False  ...       False       False
562        False        True      False  ...       False       False

      title_Mme  title_Mr  title_Mrs  title_Ms  title_Rev  title_Sir  \
1234      False      True      False     False      False      False
579       False      True      False     False      False      False
1167      False      True      False     False      False      False
723       False      True      False     False      False      False
562       False      True      False     False      False      False

      title_Unknown  title_the Countess
1234          False               False
579           False               False
1167          False               False
723           False               False
562           False               False

[5 rows x 27 columns]
148    0
871    0
523    1
810    1
343    1
Name: survived, dtype: int64
1234    0
579     0
1167    1
723     0
562     0
Name: survived, dtype: int64